[
  {
    "program": "ENVR",
    "code": "1030",
    "name": "Environment and Health",
    "units": 3,
    "info": {
      "attributes": "Common Core (S&T) for 36-credit program<br>Common Core (T) for 30-credit program",
      "pre-requisite": "a passing letter grade in LANG 1401 OR LANG 1402 OR LANG 1403 OR LANG 1404 OR LANG 1002 (prior to 2022-23)",
      "description": "This course is intended for UG students of all backgrounds. The course will cover concepts in environmental health including topics on outdoor and indoor environments, workplace, water and sewage, food, genetically modified organism, solid waste, communicable diseases, vectors and control, injury prevention, ionizing and non-ionizing radiation, nanomaterials, environmental health standards, monitoring methods, energy related health issues, natural and manmade disasters, etc. The discussions on each of these topics will include nature of the issue, known and potential health effects, control and regulatory approaches. Local and regional examples will be used where applicable."
    },
    "attrs": [
      {
        "title": "[4Y]",
        "description": "Students admitted before 2022"
      },
      {
        "title": "[CC22]",
        "description": "Students admitted from 2022"
      }
    ],
    "sections": [
      {
        "Section": "L1 (2430)",
        "Date & Time": "TuTh 10:30AM - 11:50AM",
        "Room": "Rm 5583, Lift 29-30 (80)",
        "Instructor": [
          "KWAN, Joseph Kai Cho",
          "YU, Samuel Chung Toi"
        ],
        "TA/IA/GTA": [],
        "Quota": 80,
        "Enrol": 80,
        "Avail": 0,
        "Wait": 135,
        "Remarks": []
      }
    ]
  },
  {
    "program": "ENVR",
    "code": "1080",
    "name": "The Smart Consumer - Uncovering the Hidden Story behind the Product Label",
    "units": 3,
    "info": {
      "attributes": "Common Core (SA) for 36-credit program<br>Common Core (SA) for 30-credit program<br>[EXP] Experiential learning",
      "pre-requisite": "a passing letter grade in LANG 1401 OR LANG 1402 OR LANG 1403 OR LANG 1404 OR LANG 1002 (prior to 2022-23)",
      "exclusion": "CORE 1943",
      "description": "The choices we make in daily life - the food we eat, the clothes we wear, the products and services we use - define our lifestyle. With increasing pressure through climate change and resource constraints, many people intend to consume in a sustainable manner. But with vague “green promises,” complex ingredient lists, and opaque production processes, we often do not know what is inside the products we use and how they were made. This course will investigate everyday products and explore features that make them (un)sustainable by applying a product life-cycle approach. It will also provide insights into the factors that influence our consumption decisions and how consumer behavior can be changed. Students get the opportunity (through small exercises, activities, and discussions) to investigate about consumption in Hong Kong and explore how companies and governments can help individual consumers to make smarter, more sustainable consumption choices."
    },
    "attrs": [
      {
        "title": "[4Y]",
        "description": "Students admitted before 2022"
      },
      {
        "title": "[CC22]",
        "description": "Students admitted from 2022"
      },
      {
        "title": "[DELI]",
        "description": "Mode of Delivery"
      }
    ],
    "sections": [
      {
        "Section": "L1 (2431)",
        "Date & Time": "TuTh 09:00AM - 10:20AM",
        "Room": "Rm 5620, Lift 31-32 (70)",
        "Instructor": [
          "SAUERWEIN, Meike"
        ],
        "TA/IA/GTA": [],
        "Quota": 65,
        "Enrol": 65,
        "Avail": 0,
        "Wait": 58,
        "Remarks": [
          "The class is delivered in a experiential learning mode"
        ]
      }
    ]
  },
  {
    "program": "ENVR",
    "code": "1170",
    "name": "Science, Environment and Society - From Big Bang to Big Data",
    "units": 3,
    "info": {
      "attributes": "Common Core (S&T) for 36-credit program",
      "exclusion": "CIVL 1190",
      "description": "A scientific narrative of the evolution of the universe from the Big Bang all the way to the present (also known as Big History) will be introduced in this course. The course outlines how scientific methods can be used to understand the evolution of the physical, biological and social environment around us. It highlights the transdisciplinary nature of scientific knowledge, the importance of collaboration and self-critical claim testing, the accumulation of knowledge, the acceleration of technology all the way to Big Data and AI, and finally the social and environmental challenges posed by these changes. Climate change will be used as a detailed example of a complex environment and sustainability challenges in the 21st century.  Students will be guided to appreciate how collaborations and system-thinking with integration and sharing of concepts across disciplines are required for addressing these challenges."
    },
    "attrs": [
      {
        "title": "[4Y]",
        "description": "Students admitted before 2022"
      }
    ],
    "sections": [
      {
        "Section": "L1 (2432)",
        "Date & Time": "TuTh 09:00AM - 10:20AM",
        "Room": "Lecture Theater K (106)",
        "Instructor": [
          "LAU, Kai Hon Alexis"
        ],
        "TA/IA/GTA": [],
        "Quota": 75,
        "Enrol": 71,
        "Avail": 4,
        "Wait": 0,
        "QuotaDetail": {
          "ENVR": {
            "Quota": 30,
            "Enrol": 30,
            "Avail": 0
          }
        },
        "Remarks": []
      }
    ]
  },
  {
    "program": "ENVR",
    "code": "2001",
    "name": "Academic and Professional Development I",
    "units": 1,
    "info": {
      "description": "This is the first course of the series designed to assist students in developing attributes necessary for professional growth. This course is a one-year course designed to provide academic advising to students, to enhance their understanding of the latest environment topics, and to improve their communication skills. Students are required to attend discussion sessions with advisors and selected seminars. For EVMT students only. Graded P or F."
    },
    "attrs": [],
    "sections": [
      {
        "Section": "L1 (2433)",
        "Date & Time": "Tu 06:00PM - 07:20PM",
        "Room": "Rm 2502, Lift 25-26 (120)",
        "Instructor": [
          "LAU, Pui Sang"
        ],
        "TA/IA/GTA": [],
        "Quota": 40,
        "Enrol": 27,
        "Avail": 13,
        "Wait": 0,
        "Remarks": []
      }
    ]
  },
  {
    "program": "ENVR",
    "code": "2090",
    "name": "Environmental Laboratory",
    "units": 2,
    "info": {
      "description": "This course is an integrated laboratory course designed for students in Environmental Management and Technology. Students will relate the environmental principles and theories in practice and gain hands-on experience. Students will be trained to perform basic environmental laboratory experiments, collect and handle environmental samples, operate environmental instruments, analyze and interpretate the experimental data. For EVMT students only."
    },
    "attrs": [],
    "sections": [
      {
        "Section": "LA1 (2434)",
        "Date & Time": "Mo 01:30PM - 05:20PM",
        "Room": "Rm 5564, Lift 27-28 (30)",
        "Instructor": [
          "GU, Dasa",
          "LAU, Ngai Ting",
          "WANG, Zhe",
          "YU, Jianzhen"
        ],
        "TA/IA/GTA": [],
        "Quota": 12,
        "Enrol": 10,
        "Avail": 2,
        "Wait": 0,
        "QuotaDetail": {
          "ENVR": {
            "Quota": 12,
            "Enrol": 10,
            "Avail": 2
          }
        },
        "Remarks": []
      }
    ]
  },
  {
    "program": "ENVR",
    "code": "3001",
    "name": "Academic and Professional Development II",
    "units": 1,
    "info": {
      "description": "This is second course of the series designed to assist students in developing attributes necessary for professional growth. This course is a one-year course designed to provide academic advising to students, to enhance their understanding of the latest environment topics, and to improve their communication skills. Students are required to attend discussion sessions with advisors and selected seminars. For EVMT students only. Graded P or F."
    },
    "attrs": [],
    "sections": [
      {
        "Section": "L1 (2435)",
        "Date & Time": "Tu 06:00PM - 07:20PM",
        "Room": "Rm 2502, Lift 25-26 (120)",
        "Instructor": [
          "LAU, Pui Sang"
        ],
        "TA/IA/GTA": [],
        "Quota": 40,
        "Enrol": 22,
        "Avail": 18,
        "Wait": 0,
        "Remarks": []
      }
    ]
  },
  {
    "program": "ENVR",
    "code": "3005",
    "name": "Environmental Sustainability: Risks and Challenges",
    "units": 3,
    "info": {
      "pre-requisite": "SUST 1000",
      "description": "Environmental changes, whether natural or human-induced, pose potential threats or losses to the environment and society. Called environmental risks, they can affect human health, economic development, and social stability in significant ways. Therefore, it is crucial to use scientific methods, tools, and frameworks to assess and manage these risks effectively. In this course, students will learn the concepts, principles, and methods of environmental risk assessment and management. They will also learn how to identify, quantify, assess, mitigate, and disclose environmental risks and opportunities in environmental policies, projects, or actions. Students will explore the causes, impacts, and responses of different types of environmental risks. They will also consider how these risks intersect with social justice issues, and how they can challenge and transform the power structures and inequalities that underlie environmental challenges. Finally, students will apply their knowledge and skills to real-world case studies, using various tools and frameworks, as well as understand the importance of transparent environmental risk reporting in corporate finance."
    },
    "attrs": [],
    "sections": [
      {
        "Section": "L1 (2436)",
        "Date & Time": "Fr 09:00AM - 11:50AM",
        "Room": "Rm 5620, Lift 31-32 (70)",
        "Instructor": [
          "DELINA, Laurence L."
        ],
        "TA/IA/GTA": [],
        "Quota": 40,
        "Enrol": 32,
        "Avail": 8,
        "Wait": 0,
        "QuotaDetail": {
          "ENVR": {
            "Quota": 8,
            "Enrol": 8,
            "Avail": 0
          }
        },
        "Remarks": []
      }
    ]
  },
  {
    "program": "ENVR",
    "code": "3010Q",
    "name": "Science, Environment and Society II – Teaching Demonstration",
    "units": 3,
    "info": {
      "description": "Students will complete a project related to teaching sustainability at junior secondary schools (Form 1-3) under the supervision of faculty and teaching staff. The project requires integrative understanding of the Science, Environment and Society framework, which can be obtained from the “Big History, Sustainability and Climate Change” course. Two related project courses are – SES I: Teaching resource development / enhancement and SES II: Teaching demonstration at secondary school. The SES framework covers the following modules: F1 – Science – from Big Bang to Solar System, F2 – Environment – evolution of Earth and appearance of Homo Sapiens and F3 – Society – evolution of human society."
    },
    "attrs": [],
    "sections": [
      {
        "Section": "L1 (2437)",
        "Date & Time": "TBA",
        "Room": "TBA",
        "Instructor": [
          "LAU, Kai Hon Alexis"
        ],
        "TA/IA/GTA": [],
        "Quota": 10,
        "Enrol": 5,
        "Avail": 5,
        "Wait": 0,
        "Remarks": []
      }
    ]
  },
  {
    "program": "ENVR",
    "code": "3210",
    "name": "Environmental Technology for Impact Assessment",
    "units": 3,
    "info": {
      "pre-requisite": "ENVR 2010 AND ENVR 2030",
      "exclusion": "CIVL 2410",
      "description": "The course aims to integrate the environmental technologies with management protocols in (1) assessing the environmental qualities like air, water, noise and waste, (2) formulating abatement strategies, and (3) mitigating measures in the project cycle framework to achieve the sustainable development. Projects with low environmental impact and/or low carbon footprint will also be discussed."
    },
    "attrs": [],
    "sections": [
      {
        "Section": "L1 (2438)",
        "Date & Time": "TuTh 10:30AM - 11:50AM",
        "Room": "Rm 2463, Lift 25-26 (42)",
        "Instructor": [
          "LAU, Pui Sang"
        ],
        "TA/IA/GTA": [],
        "Quota": 40,
        "Enrol": 26,
        "Avail": 14,
        "Wait": 0,
        "QuotaDetail": {
          "ENVR": {
            "Quota": 40,
            "Enrol": 26,
            "Avail": 14
          }
        },
        "Remarks": []
      }
    ]
  },
  {
    "program": "ENVR",
    "code": "3310",
    "name": "Green Business Strategy",
    "units": 3,
    "info": {
      "exclusion": "MGMT 3160",
      "description": "This is a course about new strategic opportunities arising from environmental risks. Public and regulatory demand for environmental products and services must co-exist with the corporate institutions of maximizing shareholder wealth. This course examines both the theoretical and practical issues that arise in attempting to balance the health of the natural environment with value creation. Is there an inherent conflict between the institutions of business and our ability to care for the environment? What competitive opportunities are created for firms and what do they have to do to seize these opportunities? The lessons from the course will be of interest to both students of strategy and the environment."
    },
    "attrs": [],
    "sections": [
      {
        "Section": "L1 (2439)",
        "Date & Time": "We 07:00PM - 09:50PM",
        "Room": "Rm 6602, Lift 31-32 (60)",
        "Instructor": [
          "ZHOU, Zoey Yiyuan"
        ],
        "TA/IA/GTA": [],
        "Quota": 45,
        "Enrol": 45,
        "Avail": 0,
        "Wait": 20,
        "QuotaDetail": {
          "ENVR": {
            "Quota": 45,
            "Enrol": 45,
            "Avail": 0
          }
        },
        "Remarks": []
      }
    ]
  },
  {
    "program": "ENVR",
    "code": "3410",
    "name": "Economics for Environmental Policy and Management",
    "units": 3,
    "info": {
      "pre-requisite": "ECON 2103 OR ECON 2113 OR ECON 3113",
      "description": "This course examines the economic theories behind environmental policy-making. Key concepts include externalities, common resources, market failures, polluter pays principle, and free market environmentalism. Several methods of non-market valuation of environmental goods are illustrated with real-world examples. Basic game theory is applied to understand the logic of collective actions. Throughout the course, the emphasis is on fostering an intuitive understanding of the topics from an economist’s point of view."
    },
    "attrs": [],
    "sections": [
      {
        "Section": "L1 (2440)",
        "Date & Time": "MoWe 12:00PM - 01:20PM",
        "Room": "Rm 4504, Lift 25-26 (54)",
        "Instructor": [
          "CHAN, Keith"
        ],
        "TA/IA/GTA": [],
        "Quota": 50,
        "Enrol": 50,
        "Avail": 0,
        "Wait": 1,
        "QuotaDetail": {
          "ENVR": {
            "Quota": 35,
            "Enrol": 35,
            "Avail": 0
          }
        },
        "Remarks": []
      }
    ]
  },
  {
    "program": "ENVR",
    "code": "4000P",
    "name": "Governing Green Finance: National and International Perspectives and Approaches",
    "units": 3,
    "info": {
      "description": "This course aims to provide an understanding of the international landscape of green finance institutions and the emerging global governance system around it. The course exposes students to regulatory frameworks worldwide for sustainable finance and impact investment that are explicitly intended to foster the sustainable development agenda. Finally, the course explores the connections between climate change, industry impact and financial systems."
    },
    "attrs": [],
    "sections": [
      {
        "Section": "L1 (2441)",
        "Date & Time": "Fr 07:00PM - 09:50PM",
        "Room": "Rm 4502, Lift 25-26 (60)",
        "Instructor": [
          "ZHOU, Zoey Yiyuan"
        ],
        "TA/IA/GTA": [],
        "Quota": 20,
        "Enrol": 13,
        "Avail": 7,
        "Wait": 0,
        "Remarks": [
          "Co-list with ENVR 6090E"
        ]
      }
    ]
  },
  {
    "program": "ENVR",
    "code": "4001",
    "name": "Academic and Professional Development III",
    "units": 1,
    "info": {
      "description": "This is the third course of the series designed to assist students in developing attributes necessary for professional growth. This course is a 2-semester course designed to provide academic advising to students, to enhance their understanding of the latest environment topics, and to improve their communication skills. Students are required to attend discussion sessions with advisors and selected seminars. For EVMT students only. Graded P or F."
    },
    "attrs": [],
    "sections": [
      {
        "Section": "L1 (2442)",
        "Date & Time": "Tu 06:00PM - 07:20PM",
        "Room": "Rm 2502, Lift 25-26 (120)",
        "Instructor": [
          "LAU, Pui Sang"
        ],
        "TA/IA/GTA": [],
        "Quota": 40,
        "Enrol": 31,
        "Avail": 9,
        "Wait": 0,
        "Remarks": []
      }
    ]
  },
  {
    "program": "ENVR",
    "code": "4320",
    "name": "ESG Management and Reporting",
    "units": 3,
    "info": {
      "attributes": "[BLD] Blended learning",
      "exclusion": "ACCT 3630",
      "description": "This course examines key frameworks for organizations to report their ESG performance. Following a flipped classroom (blended learning) approach, students are guided to collect corporate ESG data, comment on quality of ESG reporting, discuss issues on ESG disclosure, and study real-world cases of how various organizations manage their climate related financial risk. Throughout the course, the emphasis is on collective learning via division of labour: each student group presents their findings on ESG reporting and management in a specific industry, so that the whole class learn about a wide array of industries from their peers."
    },
    "attrs": [
      {
        "title": "[DELI]",
        "description": "Mode of Delivery"
      }
    ],
    "sections": [
      {
        "Section": "L1 (2443)",
        "Date & Time": "MoWe 09:00AM - 10:20AM",
        "Room": "Rm 5620, Lift 31-32 (70)",
        "Instructor": [
          "CHAN, Keith",
          "MOREAU, Quentin Bertrand Arthur"
        ],
        "TA/IA/GTA": [],
        "Quota": 60,
        "Enrol": 45,
        "Avail": 15,
        "Wait": 0,
        "QuotaDetail": {
          "ENVR": {
            "Quota": 35,
            "Enrol": 35,
            "Avail": 0
          }
        },
        "Remarks": [
          "The class is delivered in a blended learning mode"
        ]
      }
    ]
  },
  {
    "program": "ENVR",
    "code": "4330",
    "name": "Environmental Geographical Information System",
    "units": 3,
    "info": {
      "exclusion": "ENVR 5330, EVSM 5240",
      "description": "This course will cover a board spectrum of concepts and practices in Geographical Information System (GIS). It starts with the fundamental concepts and elements in geographic science and technology. Spatial data modeling and integration methods will then be discussed followed by various geospatial analysis approaches for both vector and raster data. Cartographic principles, spatial relationships, projection and coordinate systems will be discussed in-depth. During the course, students will be introduced to contemporary GIS software and apply GIS technology to support local and regional environmental planning and management. For EVMT students and students with consent from the instructor."
    },
    "attrs": [],
    "sections": [
      {
        "Section": "L1 (2444)",
        "Date & Time": "Th 12:00PM - 02:50PM",
        "Room": "Rm 4578, Lift 27-28",
        "Instructor": [
          "CHAN, Jimmy Wai Man"
        ],
        "TA/IA/GTA": [],
        "Quota": 25,
        "Enrol": 4,
        "Avail": 21,
        "Wait": 0,
        "Remarks": [
          "Co-list with ENVR 5330"
        ]
      }
    ]
  },
  {
    "program": "ENVR",
    "code": "4980",
    "name": "Environmental Management and Technology Capstone Project I",
    "units": 3,
    "info": {
      "description": "Each EVMT student is required to complete a capstone project before graduation. This is the first course of a two-term project in which the student can synthesize and apply knowledge from their courses. The project is conducted under the supervision of a faculty member."
    },
    "attrs": [],
    "sections": [
      {
        "Section": "T1 (2445)",
        "Date & Time": "TBA",
        "Room": "TBA",
        "Instructor": [
          "TBA"
        ],
        "TA/IA/GTA": [],
        "Quota": 5,
        "Enrol": 5,
        "Avail": 0,
        "Wait": 0,
        "Remarks": []
      }
    ]
  },
  {
    "program": "ENVR",
    "code": "4990",
    "name": "Environmental Management and Technology Capstone Project II",
    "units": 3,
    "info": {
      "pre-requisite": "ENVR 4980",
      "description": "Continuation of ENVR 4980."
    },
    "attrs": [],
    "sections": [
      {
        "Section": "T1 (2446)",
        "Date & Time": "TBA",
        "Room": "TBA",
        "Instructor": [
          "TBA"
        ],
        "TA/IA/GTA": [],
        "Quota": 40,
        "Enrol": 26,
        "Avail": 14,
        "Wait": 0,
        "Remarks": []
      }
    ]
  },
  {
    "program": "ENVR",
    "code": "5250",
    "name": "Environmental Economics and Management",
    "units": 3,
    "info": {
      "vector": "[3-0-0:3]",
      "exclusion": "ECON 5351, PPOL 5351",
      "description": "The course is designed to introduce students to key contemporary concepts in environmental economics and equip them with the approaches in economics that are generally applied to analyze environmental problems and policies.",
      "intended learning outcomes": "<span>On successful completion of the course, students will be able to:</span><table style=\"border:0px;\"><tr><td>1.</td><td>Describe basic concepts and frameworks in Microeconomics.</td></tr><tr><td>2.</td><td>Apply a structured process to solve environmental problems.</td></tr><tr><td>3.</td><td>Distinguish different ethical basis of environmental actions.</td></tr><tr><td>4.</td><td>Formulate environmental problems to be solved by economic concepts and approaches.</td></tr><tr><td>5.</td><td>Measure the benefits and costs of environmental protection actions by applying cost and benefit analysis (CBA).</td></tr><tr><td>6.</td><td>Explain the economic arguments of promotion of clean technology.</td></tr></table>"
    },
    "attrs": [],
    "sections": [
      {
        "Section": "L1 (1193)",
        "Date & Time": "Tu 07:00PM - 09:50PM",
        "Room": "Rm 4620, Lift 31-32 (126)",
        "Instructor": [
          "CHAN, Keith"
        ],
        "TA/IA/GTA": [],
        "Quota": 95,
        "Enrol": 68,
        "Avail": 27,
        "Wait": 6,
        "QuotaDetail": {
          "ENVR": {
            "Quota": 70,
            "Enrol": 48,
            "Avail": 22
          },
          "EVEM": {
            "Quota": 20,
            "Enrol": 20,
            "Avail": 0
          },
          "PPOL": {
            "Quota": 5,
            "Enrol": 0,
            "Avail": 5
          }
        },
        "Remarks": [
          "For MPhil/PhD (ESPM), MSc/PGD (EVSM/EVEM), MPM and MPP students only"
        ]
      }
    ]
  },
  {
    "program": "ENVR",
    "code": "5320",
    "name": "Environmental Data Analysis",
    "units": 3,
    "info": {
      "vector": "[3-0-0:3]",
      "description": "This course is designed for students at the start of their postgraduate studies. The course will provide students with knowledge in understanding and using statistical methods in environmental science and applications. Probability distributions, parametric tests of significance against non-parametric tests, Monte Carlo methods, Principal Component Analysis, etc. will be taught in the course facilitated by extensive use of real world problems as example.",
      "intended learning outcomes": "<span>On successful completion of the course, students will be able to:</span><table style=\"border:0px;\"><tr><td>1.</td><td>Explain the concepts of basic statistical methods.</td></tr><tr><td>2.</td><td>Use probability distributions, parametric tests, non-parametric tests and Monte Carlo methods to analyze environmental database and solve environmental problems creatively.</td></tr><tr><td>3.</td><td>Use Principal Component Analysis, and correlation methods to analyze environmental datasets and discover the linkage between the data results and with environmental problems.</td></tr><tr><td>4.</td><td>Solve the real world environmental problems using statistical tools independently and creatively.</td></tr></table>"
    },
    "attrs": [],
    "sections": [
      {
        "Section": "L1 (1194)",
        "Date & Time": "Th 07:00PM - 09:50PM",
        "Room": "Rm 4578, Lift 27-28",
        "Instructor": [
          "NING, Zhi"
        ],
        "TA/IA/GTA": [],
        "Quota": 50,
        "Enrol": 24,
        "Avail": 26,
        "Wait": 0,
        "QuotaDetail": {
          "ENVR": {
            "Quota": 50,
            "Enrol": 24,
            "Avail": 26
          }
        },
        "Remarks": [
          "For MPhil/PhD (AES/ESPM) and MSc/PGD (EVSM) students only"
        ]
      }
    ]
  },
  {
    "program": "ENVR",
    "code": "5330",
    "name": "Environmental Geographical Information System",
    "units": 3,
    "info": {
      "vector": "[3-0-0:3]",
      "exclusion": "EVSM 5240",
      "description": "This course will cover a broad spectrum of concepts and practices in Geographical Information System (GIS). It starts with the fundamental concepts and elements in geographic science and technology. Spatial data modeling and integration methods will then be discussed followed by various geospatial analysis approaches for both vector and raster data. Cartographic principles, spatial relationships, projection and coordinate systems will be discussed in-depth. During the course, students will be introduced to contemporary GIS software and apply GIS technology support local and regional environmental planning and management.",
      "intended learning outcomes": "<span>On successful completion of the course, students will be able to:</span><table style=\"border:0px;\"><tr><td>1.</td><td>Manage spatial data, including images from satellites and field data.</td></tr><tr><td>2.</td><td>Interpret spatial model data such as wind and temperature in Hong Kong.</td></tr><tr><td>3.</td><td>Analyze situations to incorporate environmental considerations into socioeconomic development.</td></tr><tr><td>4.</td><td>Formulate solutions to environmental problems by integrating and applying geospatial technologies.</td></tr><tr><td>5.</td><td>Apply GIS theory to effective resource management, environmental policy formation and decision making.</td></tr></table>"
    },
    "attrs": [],
    "sections": [
      {
        "Section": "L1 (1195)",
        "Date & Time": "Th 12:00PM - 02:50PM",
        "Room": "TBA",
        "Instructor": [
          "CHAN, Jimmy Wai Man"
        ],
        "TA/IA/GTA": [],
        "Quota": 10,
        "Enrol": 5,
        "Avail": 5,
        "Wait": 0,
        "QuotaDetail": {
          "ENVR": {
            "Quota": 10,
            "Enrol": 5,
            "Avail": 5
          }
        },
        "Remarks": [
          "For MPhil/PhD (AES/ESPM) students only",
          "Co-list with ENVR 4330",
          "Venue: Room 4578"
        ]
      }
    ]
  },
  {
    "program": "ENVR",
    "code": "5350",
    "name": "Climate Dynamics",
    "units": 3,
    "info": {
      "vector": "[3-0-0:3]",
      "description": "This course covers the dynamics of the atmosphere and ocean and the coupled dynamics, which govern our weather and climate. The course will introduce the essential features of the atmosphere and ocean circulation, as well as theories about instabilities in geophysical fluids. Knowledge and skills for running weather and climate models and analyzing data are also practiced in the course.",
      "intended learning outcomes": "<span>On successful completion of the course, students will be able to:</span><table style=\"border:0px;\"><tr><td>1.</td><td>Describe basic structures of the atmospheric and oceanic circulation.</td></tr><tr><td>2.</td><td>Explain known mechanisms governing the variability of the climate.</td></tr><tr><td>3.</td><td>Conduct further research related to climate variability.</td></tr><tr><td>4.</td><td>Present their research/practice  results to experts and general audience.</td></tr></table>"
    },
    "attrs": [],
    "sections": [
      {
        "Section": "L1 (1196)",
        "Date & Time": "Mo 03:00PM - 05:50PM",
        "Room": "Rm 4504, Lift 25-26 (54)",
        "Instructor": [
          "SHI, Xiaoming"
        ],
        "TA/IA/GTA": [],
        "Quota": 50,
        "Enrol": 24,
        "Avail": 26,
        "Wait": 0,
        "QuotaDetail": {
          "ENVR": {
            "Quota": 50,
            "Enrol": 23,
            "Avail": 27
          }
        },
        "Remarks": [
          "For MPhil/PhD (AES/ESPM) and MSc/PGD (EVSM) students only"
        ]
      }
    ]
  },
  {
    "program": "ENVR",
    "code": "5360",
    "name": "Sustainable Development Research and Practice",
    "units": 3,
    "info": {
      "vector": "[3-0-0:3]",
      "description": "This course introduces postgraduate students to critical sustainability challenges and the state-of-the-art sustainable development practices. The course will cover the up-to-date research in understanding the emergence of sustainability challenges and solution development. It will combine lectures and in-class discussions to provide students with the opportunity to think outside their ongoing research framework and enhance their transdisciplinary research capabilities of delivering useful knowledge and methods that contribute to sustainable development.",
      "intended learning outcomes": "<span>On successful completion of the course, students will be able to:</span><table style=\"border:0px;\"><tr><td>1.</td><td>Recognize the importance of sustainable development and the necessity of interdisciplinary collaboration in the delivery of sustainable development instruction and assessment.</td></tr><tr><td>2.</td><td>Understand and explain the causes of critical sustainability challenges.</td></tr><tr><td>3.</td><td>Design and integrate multi-disciplinary knowledge to define a research framework for solving a particular sustainable development issue.</td></tr><tr><td>4.</td><td>Experience problem solving and collaboration in studying solution development.</td></tr><tr><td>5.</td><td>Connect and expand their current research domain to the area of sustainable development in pursuit of future academic careers.</td></tr></table>"
    },
    "attrs": [],
    "sections": [
      {
        "Section": "L1 (1197)",
        "Date & Time": "Mo 12:00PM - 02:50PM",
        "Room": "Rm 5506, Lift 25-26 (30)",
        "Instructor": [
          "LU, Zhongming"
        ],
        "TA/IA/GTA": [],
        "Quota": 30,
        "Enrol": 22,
        "Avail": 8,
        "Wait": 0,
        "QuotaDetail": {
          "ENVR": {
            "Quota": 30,
            "Enrol": 22,
            "Avail": 8
          }
        },
        "Remarks": [
          "For MPhil/PhD (AES/ESPM) students only"
        ]
      }
    ]
  },
  {
    "program": "ENVR",
    "code": "5390",
    "name": "Satellite Remote Sensing and Informatics",
    "units": 3,
    "info": {
      "vector": "[3-0-0:3]",
      "previous code": "ENVR 6040L",
      "description": "Satellite remote sensing technique measures geophysical parameters from the electromagnetic energy emitted or reflected from the earth, and can be used to estimate earth surface characteristics, atmospheric compositions and profiles, and meteorological processes. This course provides a brief overview of the fundamental essentials to understand the remote sensing process, satellite data products, and their applications in atmosphere, land, and ocean.",
      "intended learning outcomes": "<span>On successful completion of the course, students will be able to:</span><table style=\"border:0px;\"><tr><td>1.</td><td>Identify and describe the algorithm and process used by satellite remote sensing to measure the physical properties of distant objects.</td></tr><tr><td>2.</td><td>Compare and contrast the most common sensors and techniques for satellite remote sensing.</td></tr><tr><td>3.</td><td>Explain basic electromagnetic concepts and applications to optical sensors.</td></tr><tr><td>4.</td><td>Define and exemplify the principles of applications in atmosphere, land, and ocean.</td></tr><tr><td>5.</td><td>Access satellite remote sensing products from online data archives.</td></tr><tr><td>6.</td><td>Apply data products for spatial and temporal variation analysis on parameters, compositions, and profiles of atmosphere, land, and ocean.</td></tr></table>"
    },
    "attrs": [],
    "sections": [
      {
        "Section": "L1 (1198)",
        "Date & Time": "Tu 03:00PM - 05:50PM",
        "Room": "Rm 4402, Lift 17-18",
        "Instructor": [
          "GU, Dasa"
        ],
        "TA/IA/GTA": [],
        "Quota": 60,
        "Enrol": 32,
        "Avail": 28,
        "Wait": 0,
        "QuotaDetail": {
          "ENVR": {
            "Quota": 60,
            "Enrol": 32,
            "Avail": 28
          }
        },
        "Remarks": [
          "For MPhil/PhD (AES/ESPM) and MSc/PGD (EVSM) students only"
        ]
      }
    ]
  },
  {
    "program": "ENVR",
    "code": "5400",
    "name": "Weather, Climate and Air Pollution",
    "units": 3,
    "info": {
      "vector": "[3-0-0:3]",
      "exclusion": "JEVE 5260",
      "previous code": "ENVR 6040M",
      "description": "In this course, the students will gain a deeper understanding of the weather and climate systems that affect Hong Kong and the Asia/Pacific sector, the basic physical principles governing the atmospheric motion, and the formation mechanism of severe air pollution; and be able to use online tools to assess the cause of severe air pollution episodes in Hong Kong and mainland China.",
      "intended learning outcomes": "<span>On successful completion of the course, students will be able to:</span><table style=\"border:0px;\"><tr><td>1.</td><td>Explain how the weather and climatic systems affect Hong Kong and their associations with air pollution.</td></tr><tr><td>2.</td><td>Illustrate the basic physical principles and dynamics governing the atmospheric motion and circulation.</td></tr><tr><td>3.</td><td>Correlate the atmospheric thermodynamics and dynamics and their impacts to pollutant dispersion.</td></tr><tr><td>4.</td><td>Account for the causes of severe air pollution episodes, and in particular the interaction between weather, climate, and air pollution.</td></tr><tr><td>5.</td><td>Integrate the knowledge and utilize available web resources to explain the formation, maintenance, and dissipation of air pollution episodes in Hong Kong and mainland China.</td></tr></table>"
    },
    "attrs": [],
    "sections": [
      {
        "Section": "L1 (1199)",
        "Date & Time": "We 07:00PM - 09:50PM",
        "Room": "Rm 2304, Lift 17-18 (76)",
        "Instructor": [
          "LAU, Kai Hon Alexis",
          "LIN, Changqing"
        ],
        "TA/IA/GTA": [],
        "Quota": 50,
        "Enrol": 21,
        "Avail": 29,
        "Wait": 0,
        "QuotaDetail": {
          "ENVR": {
            "Quota": 50,
            "Enrol": 21,
            "Avail": 29
          }
        },
        "Remarks": [
          "For MPhil/PhD (AES/ESPM) and MSc/PGD (EVSM) students only"
        ]
      }
    ]
  },
  {
    "program": "ENVR",
    "code": "5420",
    "name": "Climate Finance and the Carbon Markets",
    "units": 3,
    "info": {
      "vector": "[3-0-0:3]",
      "previous code": "ENVR 6090D",
      "description": "The world’s businesses and governments must take aggressive and coordinated steps in order to avert a climate catastrophe. Climate finance (investments in systems, companies and projects that sequester carbon) and the creation of new financial instruments that price carbon emissions – is a critical part of this required transformation of the global economy. This course will explore the economic and environmental impacts of climate change and the financial tools that can be used to mitigate those impacts and accelerate the sequestration and capture of carbon. Focus areas are: capital markets and exchanges, emissions trading systems, investments in low emissions technologies, project finance for nature-based climate solutions, renewable energy and other project types, corporate finance of decarbonization beyond their value change, carbon credits/offsets, and related regulatory changes.",
      "intended learning outcomes": "<span>On successful completion of the course, students will be able to:</span><table style=\"border:0px;\"><tr><td>1.</td><td>Explain possible financial solutions to climate change and its social and economic contexts using advanced scientific, finance and management knowledge and concepts.</td></tr><tr><td>2.</td><td>Evaluate financial sector impacts on climate solutions with evidence-based approaches.</td></tr><tr><td>3.</td><td>Analyze the efficacy of the carbon markets from different stakeholder perspectives.</td></tr><tr><td>4.</td><td>Appropriately communicate the role of the financial industry in climate change including positive and negative examples of climate finance to different stakeholders.</td></tr><tr><td>5.</td><td>Develop strategies and solutions to promote effective financial tools to mitigate climate change.</td></tr></table>"
    },
    "attrs": [],
    "sections": [
      {
        "Section": "L1 (4255)",
        "Date & Time": "Fr 03:00PM - 05:50PM",
        "Room": "Rm 4504, Lift 25-26 (54)",
        "Instructor": [
          "BEDFORD, Charles Ellwood"
        ],
        "TA/IA/GTA": [],
        "Quota": 50,
        "Enrol": 31,
        "Avail": 19,
        "Wait": 0,
        "QuotaDetail": {
          "ENVR": {
            "Quota": 50,
            "Enrol": 31,
            "Avail": 19
          }
        },
        "Remarks": [
          "For MPhil/PhD (ESPM) and MSc/PGD (EVSM) students only"
        ]
      }
    ]
  },
  {
    "program": "ENVR",
    "code": "6010N",
    "name": "Postgraduate Seminar",
    "units": 0,
    "info": {
      "vector": "[0-2-0:0]",
      "description": "Advanced seminar series presented by postgraduate students, faculty and guest speakers on selected topics in atmospheric environmental science or environmental science, policy and management. This course is offered once a year. Graded P or F."
    },
    "attrs": [],
    "sections": [
      {
        "Section": "T1 (1201)",
        "Date & Time": "Th 04:00PM - 05:50PM",
        "Room": "Rm 4504, Lift 25-26 (54)",
        "Instructor": [
          "CHAN, Keith",
          "MOREAU, Quentin Bertrand Arthur"
        ],
        "TA/IA/GTA": [],
        "Quota": 45,
        "Enrol": 29,
        "Avail": 16,
        "Wait": 0,
        "Remarks": [
          "For MPhil/PhD (AES/ESPM) students only"
        ]
      },
      {
        "Section": "T2 (1202)",
        "Date & Time": "Th 04:00PM - 05:50PM",
        "Room": "Rm 1032, LSK Bldg (45)",
        "Instructor": [
          "NING, Zhi"
        ],
        "TA/IA/GTA": [],
        "Quota": 45,
        "Enrol": 22,
        "Avail": 23,
        "Wait": 0,
        "Remarks": [
          "For MPhil/PhD (AES/ESPM) students only"
        ]
      }
    ]
  },
  {
    "program": "ENVR",
    "code": "6040N",
    "name": "Environmental Control Technologies for Urban Settings",
    "units": 3,
    "info": {
      "vector": "[3-0-0:3]",
      "description": "Maintaining a healthy and livable urban environment is a significant challenge that demands innovative approaches and new technologies. This course will explore control measures for mitigating environmental issues to promote the health and well-being of residents and the environment."
    },
    "attrs": [],
    "sections": [
      {
        "Section": "L1 (1203)",
        "Date & Time": "We 03:00PM - 05:50PM",
        "Room": "Rm 1527, Lift 27-28 (74)",
        "Instructor": [
          "YEUNG, King Lun"
        ],
        "TA/IA/GTA": [],
        "Quota": 50,
        "Enrol": 14,
        "Avail": 36,
        "Wait": 0,
        "QuotaDetail": {
          "ENVR": {
            "Quota": 50,
            "Enrol": 14,
            "Avail": 36
          }
        },
        "Remarks": [
          "For MPhil/PhD (AES/ESPM) and MSc/PGD (EVSM) students only"
        ]
      }
    ]
  },
  {
    "program": "ENVR",
    "code": "6090E",
    "name": "Governing Green Finance: National and International Perspectives and Approaches",
    "units": 3,
    "info": {
      "vector": "[3-0-0:3]",
      "description": "This course aims to provide an understanding of the international landscape of green finance institutions and the emerging global governance system around it. The course exposes students to regulatory frameworks worldwide for sustainable finance and impact investment that are explicitly intended to foster the sustainable development agenda. Finally, the course explores the connections between climate change, industry impact and financial systems."
    },
    "attrs": [],
    "sections": [
      {
        "Section": "L1 (1204)",
        "Date & Time": "Fr 07:00PM - 09:50PM",
        "Room": "TBA",
        "Instructor": [
          "ZHOU, Zoey Yiyuan"
        ],
        "TA/IA/GTA": [],
        "Quota": 40,
        "Enrol": 40,
        "Avail": 0,
        "Wait": 3,
        "QuotaDetail": {
          "ENVR": {
            "Quota": 40,
            "Enrol": 40,
            "Avail": 0
          }
        },
        "Remarks": [
          "Co-list with ENVR 4000P",
          "For MPhil/PhD (ESPM) and MSc/PGD (EVSM) students only",
          "Venue : Rm 4502"
        ]
      }
    ]
  },
  {
    "program": "ENVR",
    "code": "6100F",
    "name": "Independent Study",
    "units": 3,
    "info": {
      "vector": "[3 credits]",
      "description": "Study on selected topics in environmental science under the supervision of a faculty member. The course may be repeated once for credits if the topic is different."
    },
    "attrs": [],
    "sections": [
      {
        "Section": "R1 (4355)",
        "Date & Time": "TBA",
        "Room": "TBA",
        "Instructor": [
          "TBA"
        ],
        "TA/IA/GTA": [],
        "Quota": 1,
        "Enrol": 1,
        "Avail": 0,
        "Wait": 0,
        "Remarks": [
          "Instructor Consent Required"
        ]
      }
    ]
  },
  {
    "program": "ENVR",
    "code": "6770",
    "name": "Professional Development in Environmental Science, Policy and Management",
    "units": 1,
    "info": {
      "vector": "[0-1-0:1]",
      "description": "This one-credit course aims at providing research postgraduate students with basic training in research management, career development, and related professional skills. This course consists of a number of division-specific workshops. Graded PP, P or F.",
      "intended learning outcomes": "<span>On successful completion of the course, students will be able to:</span><table style=\"border:0px;\"><tr><td>1.</td><td>Develop a comprehensive set of essential transferrable skills to enhance professional development in the discipline.</td></tr><tr><td>2.</td><td>Recognize the major issues and updated development in the area of environment.</td></tr></table>"
    },
    "attrs": [],
    "sections": [
      {
        "Section": "T1 (1205)",
        "Date & Time": "TBA",
        "Room": "TBA",
        "Instructor": [
          "FUNG, Jimmy Chi Hung"
        ],
        "TA/IA/GTA": [],
        "Quota": 60,
        "Enrol": 18,
        "Avail": 42,
        "Wait": 0,
        "Remarks": [
          "For MPhil/PhD (AES) and MPhil/PhD (ESPM) students only"
        ]
      }
    ]
  },
  {
    "program": "ENVR",
    "code": "6990",
    "name": "MPhil Thesis Research",
    "units": 0,
    "info": {
      "description": "Master's thesis research supervised by a faculty member. A successful defense of the thesis leads to the grade Pass. No course credit is assigned.",
      "intended learning outcomes": "<span>On successful completion of the course, students will be able to:</span><table style=\"border:0px;\"><tr><td>1.</td><td>Acquire up-to-date and in-depth knowledge of areas of their specialization.</td></tr><tr><td>2.</td><td>Apply experimental or modeling techniques/skills for investigations of problems in their thesis research.</td></tr><tr><td>3.</td><td>Conduct directed  research, develop experimental/modeling/data analysis protocols and interpret results.</td></tr><tr><td>4.</td><td>Communicate effectively the results of scientific research in writing and by oral presentation to peers and researchers in related disciplines.</td></tr></table>"
    },
    "attrs": [],
    "sections": [
      {
        "Section": "R1 (1206)",
        "Date & Time": "TBA",
        "Room": "TBA",
        "Instructor": [
          "TBA"
        ],
        "TA/IA/GTA": [],
        "Quota": 40,
        "Enrol": 21,
        "Avail": 19,
        "Wait": 0,
        "Remarks": [
          "For MPhil(AES/ESPM) students only"
        ]
      }
    ]
  },
  {
    "program": "ENVR",
    "code": "7990",
    "name": "Doctoral Thesis Research",
    "units": 0,
    "info": {
      "description": "Original and independent doctoral thesis research. A successful defense of the thesis leads to the grade Pass. No course credit is assigned.",
      "intended learning outcomes": "<span>On successful completion of the course, students will be able to:</span><table style=\"border:0px;\"><tr><td>1.</td><td>Acquire up-to-date and in-depth knowledge of areas of their specialization.</td></tr><tr><td>2.</td><td>Apply experimental or modeling techniques/skills for investigations of problems in their thesis research.</td></tr><tr><td>3.</td><td>Conduct independent  research, propose laboratory/field/modeling experiments, develop protocols, evaluate results and formulate hypotheses.</td></tr><tr><td>4.</td><td>Communicate effectively the results of scientific research in writing and by oral presentation  to peers and researchers in related disciplines.</td></tr><tr><td>5.</td><td>Evaluate and critique current research, approaches and methodologies in their chosen thesis research areas.</td></tr></table>"
    },
    "attrs": [],
    "sections": [
      {
        "Section": "R1 (1207)",
        "Date & Time": "TBA",
        "Room": "TBA",
        "Instructor": [
          "TBA"
        ],
        "TA/IA/GTA": [],
        "Quota": 80,
        "Enrol": 63,
        "Avail": 17,
        "Wait": 0,
        "Remarks": [
          "For PhD(AES/ESPM) students only"
        ]
      }
    ]
  }
]