[
  {
    "program": "GBUS",
    "code": "1000",
    "name": "Global Leadership Development",
    "units": 0,
    "info": {
      "description": "The course is designed to promote students' personal development, teamwork, communications skills, career preparation, leadership capability, and a global mindset. For GBUS students only. Grade PP, P or F."
    },
    "attrs": [],
    "sections": [
      {
        "Section": "T1 (3897)",
        "Date & Time": "TBA",
        "Room": "TBA",
        "Instructor": [
          "TBA"
        ],
        "TA/IA/GTA": [],
        "Quota": 200,
        "Enrol": 126,
        "Avail": 74,
        "Wait": 0,
        "Remarks": []
      }
    ]
  },
  {
    "program": "GBUS",
    "code": "2010",
    "name": "Global Business Analysis",
    "units": 3,
    "info": {
      "description": "This course develops students' proficiency in business analysis by building competence in using fundamental tools for business problem solving and delivering professional presentations. For GBUS students or students with consent from the instructor."
    },
    "attrs": [],
    "sections": [
      {
        "Section": "L1 (3935)",
        "Date & Time": "01-FEB-2024 - 15-MAR-2024<br>Fr 03:00PM - 05:50PM",
        "Room": "Rm 1005, LSK Bldg (70)",
        "Instructor": [
          "CHEW, Thian",
          "DORAN, Christopher"
        ],
        "TA/IA/GTA": [],
        "Quota": 60,
        "Enrol": 53,
        "Avail": 7,
        "Wait": 0,
        "Remarks": []
      },
      {
        "Section": "L1 (3935)",
        "Date & Time": "16-MAR-2024 - 04-MAY-2024<br>Sa 09:00AM - 11:50AM",
        "Room": "Rm 1005, LSK Bldg (70)",
        "Instructor": [
          "CHEW, Thian",
          "DORAN, Christopher"
        ],
        "TA/IA/GTA": [],
        "Quota": 60,
        "Enrol": 53,
        "Avail": 7,
        "Wait": 0,
        "Remarks": []
      }
    ]
  },
  {
    "program": "GBUS",
    "code": "2020",
    "name": "Public Service Project",
    "units": 1,
    "info": {
      "description": "This is a project-based service-learning course with the aim to nurture students' passion in socially responsible leadership. Students will collaborate with a non-governmental organization to design, lead, and implement a service project. For GBUS students only. Graded P or F."
    },
    "attrs": [],
    "sections": [
      {
        "Section": "R1 (3898)",
        "Date & Time": "TBA",
        "Room": "TBA",
        "Instructor": [
          "CHEUNG, Ki Ling"
        ],
        "TA/IA/GTA": [],
        "Quota": 24,
        "Enrol": 10,
        "Avail": 14,
        "Wait": 0,
        "Remarks": []
      }
    ]
  },
  {
    "program": "GBUS",
    "code": "3010",
    "name": "Global Perspectives on Contemporary Issues",
    "units": 3,
    "info": {
      "description": "This course aims to develop students' capacity for critical reflection.  To deal with human interactions in a global setting, we need to equip ourselves with a spectrum of understanding and responses that go beyond our parochial mind-set.  The course exposes students to issues outside the business field, providing an opportunity to explore relevant topics concerning their community, their world and themselves.  For GBUS students or students with consent from instructor."
    },
    "attrs": [],
    "sections": [
      {
        "Section": "L1 (3899)",
        "Date & Time": "Th 12:00PM - 02:50PM",
        "Room": "Rm 1009, LSK Bldg (80)",
        "Instructor": [
          "NEW, Mitya"
        ],
        "TA/IA/GTA": [],
        "Quota": 50,
        "Enrol": 43,
        "Avail": 7,
        "Wait": 0,
        "Remarks": []
      }
    ]
  },
  {
    "program": "GBUS",
    "code": "3040",
    "name": "Business and ESG Management for Asia and Emerging Markets",
    "units": 3,
    "info": {
      "description": "This course intends to develop a deep understanding of the contextual factors of Asia and emerging market countries, with a specific emphasis on the risks, challenges, and mitigants to doing business in these countries. In studying key business, political, economic, social, financial, and cultural characteristics of these countries, students will recognize regional differences and learn to develop relevant business strategies. Students will also explore how country differences impact business strategies and managerial decision-making. In addition, concepts that relate to corruption, corporate governance, and ESG will be covered. For GBUS students or students with instructor's approval only."
    },
    "attrs": [],
    "sections": [
      {
        "Section": "L1 (3900)",
        "Date & Time": "Th 09:00AM - 11:50AM",
        "Room": "Rm 1009, LSK Bldg (80)",
        "Instructor": [
          "CHEUNG, Cassian"
        ],
        "TA/IA/GTA": [],
        "Quota": 50,
        "Enrol": 23,
        "Avail": 27,
        "Wait": 0,
        "Remarks": []
      }
    ]
  },
  {
    "program": "GBUS",
    "code": "3050",
    "name": "Deal Making in Asia and Emerging Markets",
    "units": 3,
    "info": {
      "description": "This course introduces students to cross-border and cross-cultural business transactions in Asia and emerging markets. Analyzing cases studies of different types of real business deals, the course is designed to provide students with a comprehensive overview of doing business in these regions and the opportunity to strategize as corporate decision makers through discussions, role plays, and presentations. The objective is to sharpen students' capabilities in deal structuring, financing, negotiating, and deal closing from a strategic management perspective. For GBUS students or students with consent from the instructor."
    },
    "attrs": [],
    "sections": [
      {
        "Section": "L1 (3901)",
        "Date & Time": "TuTh 04:30PM - 05:50PM",
        "Room": "Rm 1003, LSK Bldg (70)",
        "Instructor": [
          "FRANKLIN, Laurence Craig",
          "NASON, Stephen William"
        ],
        "TA/IA/GTA": [],
        "Quota": 50,
        "Enrol": 50,
        "Avail": 0,
        "Wait": 0,
        "Remarks": []
      }
    ]
  },
  {
    "program": "GBUS",
    "code": "4000D",
    "name": "Value Investing in Global Markets",
    "units": 3,
    "info": {
      "description": "This course covers the basic theory and philosophy of value investing as it has developed since Graham. We will introduce and discuss the styles of important value investors including Graham and Buffett. We will present the basic techniques of investing: search; valuation and the construction of a portfolio. We will use the framework developed in class to study specific companies. This course will only focus on equities. For GBUS students or students with consent from the instructor."
    },
    "attrs": [],
    "sections": [
      {
        "Section": "L1 (4163)",
        "Date & Time": "Tu 09:00AM - 11:50AM",
        "Room": "Rm 1001, LSK Bldg (70)",
        "Instructor": [
          "RAO, Milind Shankar"
        ],
        "TA/IA/GTA": [],
        "Quota": 50,
        "Enrol": 12,
        "Avail": 38,
        "Wait": 0,
        "Remarks": []
      }
    ]
  },
  {
    "program": "GBUS",
    "code": "4910",
    "name": "Capstone Project",
    "units": 4,
    "info": {
      "description": "The course is designed for final year GBUS students to synthesize skills and knowledge learned from the program by undertaking a challenging individual or team capstone project. For GBUS students only."
    },
    "attrs": [],
    "sections": [
      {
        "Section": "L1 (3903)",
        "Date & Time": "Fr 06:00PM - 07:20PM",
        "Room": "Rm 1005, LSK Bldg (70)",
        "Instructor": [
          "DORAN, Christopher"
        ],
        "TA/IA/GTA": [],
        "Quota": 25,
        "Enrol": 24,
        "Avail": 1,
        "Wait": 0,
        "Remarks": []
      }
    ]
  }
]