[
  {
    "program": "MAED",
    "code": "5322",
    "name": "Methodology of Mathematics",
    "units": 3,
    "info": {
      "vector": "[3-0-0:3]",
      "description": "This course is about mathematical thinking in mathematics. One purpose is to show how mathematical concepts, terminologies, formulas, equations, and theories are developed through examples of calculus, analysis, algebra, geometry, combinatorics, and probability, etc. The other purpose is to provide a global picture of mathematics by discussing its foundations, structures, internal relations, crises, and envisions. It is a combination of history, pedagogy, methodology, and philosophy of mathematics.",
      "intended learning outcomes": "<span>On successful completion of the course, students will be able to:</span><table style=\"border:0px;\"><tr><td>1.</td><td>Solve problems by the methods of induction, analogy and association.</td></tr><tr><td>2.</td><td>Apply the methods of axiomatization/foundations of mathematics.</td></tr><tr><td>3.</td><td>Explain and solve the classical three Greek math problems.</td></tr><tr><td>4.</td><td>Apply the art of infinity -- the distinction between elementary math and advanced math.</td></tr><tr><td>5.</td><td>Apply the methods of infinitesimal and integration – the foundation of differential and integral calculus.</td></tr><tr><td>6.</td><td>Solve problems by the Relation Mapping Inversion Principle.</td></tr><tr><td>7.</td><td>Analyze problems by the method of Simulation Principle.</td></tr><tr><td>8.</td><td>Describe interesting stories, events, historic schools and philosophy of mathematics.</td></tr></table>"
    },
    "attrs": [],
    "sections": [
      {
        "Section": "L1 (1428)",
        "Date & Time": "Tu 07:00PM - 09:50PM",
        "Room": "Rm 2407, Lift 17-18 (126)",
        "Instructor": [
          "CHEN, Beifang"
        ],
        "TA/IA/GTA": [],
        "Quota": 120,
        "Enrol": 62,
        "Avail": 58,
        "Wait": 0,
        "Remarks": [
          "For MSc(MAED) students only."
        ]
      }
    ]
  },
  {
    "program": "MAED",
    "code": "5421",
    "name": "Probability and Statistics",
    "units": 3,
    "info": {
      "vector": "[3-0-0:3]",
      "description": "This course illustrates how to use statistical and probabilistic techniques with an open source statistics package R to analyze data, especially in education.",
      "intended learning outcomes": "<span>On successful completion of the course, students will be able to:</span><table style=\"border:0px;\"><tr><td>1.</td><td>Identify the core ideas on analyzing data.</td></tr><tr><td>2.</td><td>Communicate effectively the statistical results to both lay and expert audiences utilizing appropriate information and suitable technology.</td></tr><tr><td>3.</td><td>Apply rigorous, analytic and highly numerate methods to analyze and solve problems in daily life and at work.</td></tr><tr><td>4.</td><td>Carry out objective analysis and prediction of quantitative information with independent judgement.</td></tr></table>"
    },
    "attrs": [],
    "sections": [
      {
        "Section": "L1 (1429)",
        "Date & Time": "Fr 07:00PM - 09:50PM",
        "Room": "Rm 2464, Lift 25-26 (122)",
        "Instructor": [
          "YU, Chi Wai"
        ],
        "TA/IA/GTA": [],
        "Quota": 120,
        "Enrol": 72,
        "Avail": 48,
        "Wait": 0,
        "Remarks": [
          "For MSc(MAED) students only."
        ]
      }
    ]
  },
  {
    "program": "MAED",
    "code": "5511",
    "name": "Teaching Mathematics in the Digital Age",
    "units": 3,
    "info": {
      "vector": "[3-0-0:3]",
      "description": "This course is about the use of various digital tools to produce interactive teaching materials for mathematics and the pedagogical framework of designing mathematics lessons using digital tools that can enhance the effectiveness of students’ learning.",
      "intended learning outcomes": "<span>On successful completion of the course, students will be able to:</span><table style=\"border:0px;\"><tr><td>1.</td><td>Apply the theoretical frameworks that guide the process of developing mathematics pedagogy using digital tools.</td></tr><tr><td>2.</td><td>Use various e-learning tools to design effective mathematics lessons.</td></tr><tr><td>3.</td><td>Convey fundamental concepts in geometry, calculus, algebra, and statistics with the help of digital tools.</td></tr></table>"
    },
    "attrs": [],
    "sections": [
      {
        "Section": "L1 (1430)",
        "Date & Time": "We 07:00PM - 09:50PM",
        "Room": "Rm 4582, Lift 27-28 (66)",
        "Instructor": [
          "KU, Yin Bon"
        ],
        "TA/IA/GTA": [],
        "Quota": 48,
        "Enrol": 48,
        "Avail": 0,
        "Wait": 21,
        "Remarks": [
          "For MSc(MAED) students only."
        ]
      }
    ]
  },
  {
    "program": "MAED",
    "code": "5611",
    "name": "Pedagogy in Mathematics Teaching",
    "units": 3,
    "info": {
      "vector": "[3-0-0:3]",
      "description": "This course focuses on intricate teaching methods and best practices in mathematics education. It delves into effective teaching strategies, the application of advanced technology in mathematics instruction, current trends and challenges in mathematics education, and the integration of cultural diversity in the classroom. Designed for educators and those aspiring to specialize in mathematics education, this course aims to enhance their teaching proficiency. Upon completion, participants will have a full grasp of effective strategies for math instruction and will be equipped to design compelling math lessons for their students.",
      "intended learning outcomes": "<span>On successful completion of the course, students will be able to:</span><table style=\"border:0px;\"><tr><td>1.</td><td>Demonstrate a comprehensive understanding of historical and theoretical foundations in mathematics education.</td></tr><tr><td>2.</td><td>Apply a range of effective teaching strategies and techniques that promote mathematical understanding, critical thinking, and problem-solving skills.</td></tr><tr><td>3.</td><td>Utilize various digital tools and resources to enhance student engagement and learning in mathematics.</td></tr><tr><td>4.</td><td>Develop differentiated and inclusive learning experiences that cater to the diverse needs and abilities of students in the mathematics classroom.</td></tr><tr><td>5.</td><td>Design and implement authentic formative and summative assessments to evaluate student progress and provide constructive feedback.</td></tr><tr><td>6.</td><td>Critically analyze real-life teaching practices and integrate best practices observed in teaching practice videos.</td></tr><tr><td>7.</td><td>Create well-structured, engaging, and inclusive mathematics lesson plans that incorporate effective teaching strategies, tools, and assessments.</td></tr><tr><td>8.</td><td>Engage in continuous professional development, reflection, and collaboration, setting future goals for improvement in mathematics teaching practices.</td></tr></table>"
    },
    "attrs": [],
    "sections": [
      {
        "Section": "L1 (1431)",
        "Date & Time": "Th 07:00PM - 09:50PM",
        "Room": "Rm 4582, Lift 27-28 (66)",
        "Instructor": [
          "TBA"
        ],
        "TA/IA/GTA": [],
        "Quota": 60,
        "Enrol": 60,
        "Avail": 0,
        "Wait": 9,
        "Remarks": [
          "Instructor: XU, Xiaoyu",
          "For MSc(MAED) students only."
        ]
      }
    ]
  },
  {
    "program": "MAED",
    "code": "5821",
    "name": "Topics in Mathematics",
    "units": 3,
    "info": {
      "vector": "[3-0-0:3]",
      "description": "This course introduces a selection of topics from interdisciplinary mathematics, which may include mathematical physics, mathematical biology, image processing, etc.",
      "intended learning outcomes": "<span>On successful completion of the course, students will be able to:</span><table style=\"border:0px;\"><tr><td>1.</td><td>Apply theoretical knowledge, principles and techniques to mathematical physics, mathematical biology and traffic flows.</td></tr><tr><td>2.</td><td>Recognize roles of mathematics in solving some mathematical physics, mathematical biology and traffic flows.</td></tr><tr><td>3.</td><td>Apply various theorems to study ideal mathematical models, such as ideal 2-dimensional fluid flows, ideal electrostatic force fields, steady state temperature, etc.</td></tr><tr><td>4.</td><td>Present solutions of some physical problems in a systematic way.</td></tr></table>"
    },
    "attrs": [],
    "sections": [
      {
        "Section": "L1 (1432)",
        "Date & Time": "Sa 09:30AM - 12:20PM",
        "Room": "Rm 2464, Lift 25-26 (122)",
        "Instructor": [
          "HO, Hon Ming"
        ],
        "TA/IA/GTA": [],
        "Quota": 120,
        "Enrol": 44,
        "Avail": 76,
        "Wait": 0,
        "Remarks": [
          "For MSc(MAED) students only."
        ]
      }
    ]
  },
  {
    "program": "MAED",
    "code": "5841",
    "name": "Topics in Applied Mathematics for Mathematics Educators",
    "units": 3,
    "info": {
      "vector": "[3-0-0:3]",
      "description": "This course introduces a selection of topics in applied mathematics, which may include mathematical modelling, differential equations, data analysis and visualization, scientific computation, etc., and their connections with mathematical applications and pedagogy approaches.",
      "intended learning outcomes": "<span>On successful completion of the course, students will be able to:</span><table style=\"border:0px;\"><tr><td>1.</td><td>Identify and appreciate the concepts, techniques and processes of mathematical modelling originated from secondary school Mathematics curriculum.</td></tr><tr><td>2.</td><td>Appreciate and formulate the use of numerical methods in specific daily life scenarios.</td></tr><tr><td>3.</td><td>Solve formulated mathematical problems with the aids of appropriate numerical methods and coding techniques.</td></tr><tr><td>4.</td><td>Interpret the numerical results and compare the strengths and weaknesses of different approaches.</td></tr><tr><td>5.</td><td>Present standard examples of mathematical modelling that are connected with secondary school Mathematics topics.</td></tr><tr><td>6.</td><td>Design a method to improve the original technique or scientific model adopted.</td></tr><tr><td>7.</td><td>Incorporate the mathematical ideas and IT tools into education activities and teaching.</td></tr></table>"
    },
    "attrs": [],
    "sections": [
      {
        "Section": "L1 (1433)",
        "Date & Time": "Mo 07:00PM - 09:50PM",
        "Room": "Lecture Theater G (132)",
        "Instructor": [
          "MAK, Hugo Wai Leung"
        ],
        "TA/IA/GTA": [],
        "Quota": 120,
        "Enrol": 58,
        "Avail": 62,
        "Wait": 0,
        "Remarks": [
          "For MSc(MAED) students only."
        ]
      }
    ]
  },
  {
    "program": "MAED",
    "code": "6980",
    "name": "MSc Project",
    "units": 3,
    "info": {
      "vector": "[3 credits]",
      "description": "In this course, the student will do a project in an area of mathematics or mathematics education under the guidance of a faculty member. The project either surveys a topic, develops teaching plans and materials, or describes an investigation completed by the student.",
      "intended learning outcomes": "<span>On successful completion of the course, students will be able to:</span><table style=\"border:0px;\"><tr><td>1.</td><td>Explain advanced mathematical theories, concepts and principles using precise mathematical language, and identify the applications of this knowledge in different daily life scenarios.</td></tr><tr><td>2.</td><td>Apply independent judgment to investigative mathematical work or relevant educational materials.</td></tr><tr><td>3.</td><td>Apply a rigorous, logical and analytic approach to execute tasks and solve mathematical problems.</td></tr><tr><td>4.</td><td>Communicate mathematical concepts and methods effectively to a range of audiences, both orally and in writing.</td></tr><tr><td>5.</td><td>Work effectively on a prescribed topic in mathematics or mathematics education, and show the capability of delivering presentations in front of professional teachers or scientific experts.</td></tr></table>"
    },
    "attrs": [],
    "sections": [
      {
        "Section": "R1 (4350)",
        "Date & Time": "TBA",
        "Room": "TBA",
        "Instructor": [
          "FUNG, Jimmy Chi Hung"
        ],
        "TA/IA/GTA": [],
        "Quota": 3,
        "Enrol": 0,
        "Avail": 3,
        "Wait": 0,
        "Remarks": [
          "Students should seek the instructor's approval to take this course.",
          "Instructor Consent Required"
        ]
      },
      {
        "Section": "R2 (4351)",
        "Date & Time": "TBA",
        "Room": "TBA",
        "Instructor": [
          "MAK, Hugo Wai Leung"
        ],
        "TA/IA/GTA": [],
        "Quota": 4,
        "Enrol": 0,
        "Avail": 4,
        "Wait": 0,
        "Remarks": [
          "Students should seek the instructor's approval to take this course.",
          "Instructor Consent Required"
        ]
      }
    ]
  }
]