[
  {
    "program": "MILE",
    "code": "5108",
    "name": "Foundations of Technology-enhanced Language Education",
    "units": 3,
    "info": {
      "attributes": "[ONL] Pure online delivery",
      "vector": "[3-0-0:3]",
      "exclusion": "MILE 5102 (prior to 2018-19)",
      "previous code": "MILE 5003",
      "description": "Technology and language have always been at the forefront of human development and civilization. Fundamental to the advancement of society are the ways that changing technologies impact and shape learning. This course explores the issues of how information technologies structure human cognition and social interaction and the ways which teachers can use these technologies to improve student learning. This course capitalizes on these new modes of learning to advance language teaching and learning. Gaining a better understanding of these emerging technologies can enrich teaching methodologies and extend theoretical concepts. For MA(ILE) students or students with program director or course instructor's approval only.",
      "intended learning outcomes": "<span>On successful completion of the course, students will be able to:</span><table style=\"border:0px;\"><tr><td>1.</td><td>Explain how information technologies are shaping social interaction in and through the medium of language.</td></tr><tr><td>2.</td><td>Analyze how learning in general, and language learning in specific, can be enhanced through the use of information technologies.</td></tr><tr><td>3.</td><td>Examine how technologies can bridge communities and create pathways for greater interaction and social harmony.</td></tr><tr><td>4.</td><td>Design and implement research-embedded technology-enhanced teaching approaches for second-language acquisition.</td></tr></table>"
    },
    "attrs": [
      {
        "title": "[DELI]",
        "description": "Mode of Delivery"
      }
    ],
    "sections": [
      {
        "Section": "L1 (1695)",
        "Date & Time": "TBA",
        "Room": "TBA",
        "Instructor": [
          "CHEUNG, Anisa"
        ],
        "TA/IA/GTA": [],
        "Quota": 18,
        "Enrol": 18,
        "Avail": 0,
        "Wait": 7,
        "Remarks": [
          "For MA(ILE) students or students with program director or course instructor's approval only",
          "The class is delivered in a pure online mode"
        ]
      }
    ]
  },
  {
    "program": "MILE",
    "code": "5109",
    "name": "Bi/Multilingual Approaches to Language Education",
    "units": 3,
    "info": {
      "vector": "[3-0-0:3]",
      "description": "This course is designed to introduce potential language teachers to general issues and current developments in bi/multilingual approaches to language education. The first part of the course focuses on individual bi/multilingualism. It will examine the basics of how bi/multilingualism is defined and measured, types of bi/multilingualism, and bi/multilingual language behaviors. The second part of the course explores foundations of bi/multilingual language education. Topics include second language versus bilingual acquisition, bilingualism and cognition, and bilingual education for bilingualism and biliteracy. The third part of the course focuses on pedagogical issues and practices in bi/multilingual language education. We will discuss the uses and roles of translation in language teaching, translanguaging in pedagogy, and mixed code and classroom code-switching, with special attention given to the teaching of Chinese and English in the context of Hong Kong. For MA(ILE) students or students with program director or course instructor's approval only.",
      "intended learning outcomes": "<span>On successful completion of the course, students will be able to:</span><table style=\"border:0px;\"><tr><td>1.</td><td>Describe and illustrate different definitions of bi/multilingualism and methods of measuring bi/multilingualism.</td></tr><tr><td>2.</td><td>Describe and illustrate how bi/multilinguals learn and use their languages.</td></tr><tr><td>3.</td><td>Describe different kinds of bi/multilingual education and how they have been evaluated.</td></tr><tr><td>4.</td><td>Discuss pedagogical issues and practices in bi/multilingual language education.</td></tr><tr><td>5.</td><td>Design appropriate teaching plans taking into account the characteristics of the school context and the larger sociolinguistic context.</td></tr><tr><td>6.</td><td>Appreciate the importance of bi/multilingualism in the age of globalization.</td></tr></table>"
    },
    "attrs": [],
    "sections": [
      {
        "Section": "L1 (1696)",
        "Date & Time": "MoWe 12:00PM - 01:20PM",
        "Room": "G002, CYT Bldg (30)",
        "Instructor": [
          "LAW, Wai Ling"
        ],
        "TA/IA/GTA": [],
        "Quota": 21,
        "Enrol": 21,
        "Avail": 0,
        "Wait": 1,
        "Remarks": [
          "For MA(ILE) students or students with program director or course instructor's approval only"
        ]
      }
    ]
  },
  {
    "program": "MILE",
    "code": "5202",
    "name": "Teaching Second Language Vocabulary",
    "units": 3,
    "info": {
      "vector": "[3-0-0:3]",
      "previous code": "MALE 5202",
      "description": "This course examines the factors involved in developing second language (L2) learners' acquisition of English vocabulary. It covers three main areas: (a) words and the description of the vocabulary content of an English curriculum, (b) the representation of L2 vocabulary in the mental lexicon and related acquisitor issues, and (c) approaches to teaching L2 vocabulary. For MA(ILE) students or students with program director or course instructor's approval only.",
      "intended learning outcomes": "<span>On successful completion of the course, students will be able to:</span><table style=\"border:0px;\"><tr><td>1.</td><td>Describe the internal structure of English words and the main lexical relations.</td></tr><tr><td>2.</td><td>Recognize how second language vocabulary is acquired.</td></tr><tr><td>3.</td><td>Identify factors that contribute to successful vocabulary acquisition.</td></tr><tr><td>4.</td><td>Evaluate the merits of different approaches for teaching L2 vocabulary.</td></tr></table>"
    },
    "attrs": [],
    "sections": [
      {
        "Section": "L1 (1697)",
        "Date & Time": "Mo 01:30PM - 04:20PM",
        "Room": "Rm 2127C, Lift 19 (28)",
        "Instructor": [
          "CHI, Man Lai Amy"
        ],
        "TA/IA/GTA": [],
        "Quota": 25,
        "Enrol": 25,
        "Avail": 0,
        "Wait": 1,
        "Remarks": [
          "For MA(ILE) students or students with program director or course instructor's approval only"
        ]
      }
    ]
  },
  {
    "program": "MILE",
    "code": "5208",
    "name": "Discourse Analysis",
    "units": 3,
    "info": {
      "vector": "[3-0-0:3]",
      "previous code": "MILE 5101, MALE 5101",
      "description": "Discourse Analysis is the study of patterns of language within written and spoken texts and the social contexts in which the texts occur. The course aims to introduce key concepts of discourse analysis and a number of approaches to analyzing written and spoken texts. The course places emphasis on hands-on discourse analysis so students are able to familiarize themselves with the different approaches and become competent in the text analysis process. For MA(ILE) students or students with program director or course instructor's approval only.",
      "intended learning outcomes": "<span>On successful completion of the course, students will be able to:</span><table style=\"border:0px;\"><tr><td>1.</td><td>Identify a range of written and spoken text types.</td></tr><tr><td>2.</td><td>Develop skills in analyzing the rhetorical, grammatical and lexical structure of texts.</td></tr><tr><td>3.</td><td>Explain significant features of classroom communication.</td></tr><tr><td>4.</td><td>Apply discourse analysis in language teaching.</td></tr></table>"
    },
    "attrs": [],
    "sections": [
      {
        "Section": "L1 (1698)",
        "Date & Time": "MoWe 10:30AM - 11:50AM",
        "Room": "Rm 2127C, Lift 19 (28)",
        "Instructor": [
          "LEE, William W L"
        ],
        "TA/IA/GTA": [],
        "Quota": 25,
        "Enrol": 24,
        "Avail": 1,
        "Wait": 0,
        "Remarks": [
          "For MA(ILE) students or students with program director or course instructor's approval only"
        ]
      }
    ]
  },
  {
    "program": "MILE",
    "code": "5209",
    "name": "English-Medium Instruction and International Education",
    "units": 3,
    "info": {
      "vector": "[3-0-0:3]",
      "description": "English-Medium Instruction (EMI), an emerging educational approach, has become a global phenomenon in higher education and has received increasing attention in primary and secondary education. This course approaches the EMI phenomenon from a critical perspective. We will cover national policies and institutional practices in overseas and local contexts, teacher perceptions and student attitudes, drivers and difficulties for EMI implementation, etc. By the end of this course, students will have formed a comprehensive and critical understanding of the key issues in EMI research. For MA(ILE) students or students with program director or course instructor's approval only.",
      "intended learning outcomes": "<span>On successful completion of the course, students will be able to:</span><table style=\"border:0px;\"><tr><td>1.</td><td>Explain the definition, origin, and current development of EMI research.</td></tr><tr><td>2.</td><td>Illustrate the features of EMI development in different regions of the world and the historical, social, and cultural factors that influence this development.</td></tr><tr><td>3.</td><td>Critically analyze different stakeholders’ perceptions of the importance, benefits, and challenges of EMI and why EMI is a contested notion.</td></tr><tr><td>4.</td><td>Identify the challenges of implementing EMI in the classroom and potential solutions and coping strategies.</td></tr><tr><td>5.</td><td>Apply research-informed principles or decisions in EMI curricula development and student assessment.</td></tr></table>"
    },
    "attrs": [],
    "sections": [
      {
        "Section": "L1 (1699)",
        "Date & Time": "TuTh 10:30AM - 11:50AM",
        "Room": "Rm 2126B, Lift 19 (28)",
        "Instructor": [
          "ZHOU, Siyang"
        ],
        "TA/IA/GTA": [],
        "Quota": 25,
        "Enrol": 23,
        "Avail": 2,
        "Wait": 0,
        "Remarks": [
          "For MA(ILE) students or students with program director or course instructor's approval only"
        ]
      }
    ]
  },
  {
    "program": "MILE",
    "code": "5210",
    "name": "Functional Grammar in the Language Classroom",
    "units": 3,
    "info": {
      "vector": "[3-0-0:3]",
      "description": "This course takes a functional perspective to emphasize the way spoken and written language operate in different social situations. Using the systemic functional approach to language analysis, the course explores how grammar and discourse features can be used to teach language in context. It focuses on the knowledge and skills needed to design and implement effective language teaching materials that incorporate Functional Grammar principles in the language classroom and examines the benefits and drawbacks of using a functional approach to language pedagogy. For MA(ILE) students or students with program director or course instructor's approval only.",
      "intended learning outcomes": "<span>On successful completion of the course, students will be able to:</span><table style=\"border:0px;\"><tr><td>1.</td><td>Demonstrate an understanding of the key concepts and principles of Functional Grammar, including the systemic functional approach to language analysis.</td></tr><tr><td>2.</td><td>Analyze different types of textual genres using Functional Grammar, including written, spoken, and multimodal texts.</td></tr><tr><td>3.</td><td>Analyze and evaluate language teaching and learning materials using Functional Grammar principles, and develop strategies for integrating Functional Grammar into language teaching materials.</td></tr><tr><td>4.</td><td>Design research-informed classroom activities, lesson plans and assessments that incorporate Functional Grammar principles, and evaluate their effectiveness in promoting language learning.</td></tr><tr><td>5.</td><td>Reflect on the strengths and shortcomings of the Functional Grammar approach to language teaching and learning.</td></tr></table>"
    },
    "attrs": [],
    "sections": [
      {
        "Section": "L1 (1700)",
        "Date & Time": "TuTh 12:00PM - 01:20PM",
        "Room": "Rm 2126C, Lift 19 (28)",
        "Instructor": [
          "JHAVERI, Aditi"
        ],
        "TA/IA/GTA": [],
        "Quota": 25,
        "Enrol": 20,
        "Avail": 5,
        "Wait": 0,
        "Remarks": [
          "For MA(ILE) students or students with program director or course instructor's approval only"
        ]
      }
    ]
  },
  {
    "program": "MILE",
    "code": "5301",
    "name": "Chinese Writing and Culture",
    "units": 3,
    "info": {
      "attributes": "[C] Require Chinese reading",
      "vector": "[3-0-0:3]",
      "previous code": "MALE 5301",
      "description": "An advanced-level study of the Chinese writing system as a quintessential embodiment and carrier of Chinese culture, covering its origin, development, classification and its orthographical and cultural characteristics. The course will begin with a theoretical introduction about the nature of the ancient scripts and modern writing systems from historical and comparative perspectives, followed by a systematic exploration of the internal structure of Chinese script in accordance with a newly-developed framework, i.e., the three-principle theory of Chinese script, by which thousands of characters coming from the archeological materials such as jiaguwen (oracle bone inscriptions), jinwen (bronze inscriptions) and jianbowenzi (bamboo and silk scripts) can be appropriately analyzed and classified. This course also offers a critical survey of important issues related to Chinese script in modern times, including simplification, Romanization (Latinization), recognition, and adaptability to various Sinitic and Sinosphere languages, taking into consideration research in general linguistics, sociolinguistics, and heritage history. For MA(ILE) students or students with program director or course instructor's approval only.",
      "intended learning outcomes": "<span>On successful completion of the course, students will be able to:</span><table style=\"border:0px;\"><tr><td>1.</td><td>Gain a systematic understanding of how Chinese writing originated and\r\ndeveloped.</td></tr><tr><td>2.</td><td>Analyze Chinese characters and classify them into different categories in accordance with a new framework, i.e. the three-principle theory of Chinese script;</td></tr><tr><td>3.</td><td>Understand the characteristics of Chinese script at its different styles, including the oracle bone inscriptions (jiaguwen), bronze inscriptions (jinwen), clerical script (lishu) and standard script (kaishu).</td></tr><tr><td>4.</td><td>Better understand various problems arising from the current use of Chinese script.</td></tr><tr><td>5.</td><td>Function more effectively in L2 Chinese language/character teaching and learning;</td></tr><tr><td>6.</td><td>Identify the historical and cultural components implied in the Chinese writing system.</td></tr></table>"
    },
    "attrs": [
      {
        "title": "[READ]",
        "description": "Reading Material"
      }
    ],
    "sections": [
      {
        "Section": "L1 (1701)",
        "Date & Time": "Mo 04:30PM - 05:50PM",
        "Room": "Rm 2127A, Lift 19 (28)",
        "Instructor": [
          "LI, Dechao"
        ],
        "TA/IA/GTA": [],
        "Quota": 25,
        "Enrol": 21,
        "Avail": 4,
        "Wait": 0,
        "Remarks": [
          "For MA(ILE) students or students with program director or course instructor's approval only"
        ]
      },
      {
        "Section": "L1 (1701)",
        "Date & Time": "Fr 12:00PM - 01:20PM",
        "Room": "Rm 2127A, Lift 19 (28)",
        "Instructor": [
          "LI, Dechao"
        ],
        "TA/IA/GTA": [],
        "Quota": 25,
        "Enrol": 21,
        "Avail": 4,
        "Wait": 0,
        "Remarks": [
          "For MA(ILE) students or students with program director or course instructor's approval only"
        ]
      }
    ]
  },
  {
    "program": "MILE",
    "code": "5303",
    "name": "Advanced Phonetics and Phonology of the Chinese Language",
    "units": 3,
    "info": {
      "attributes": "[C] Require Chinese reading",
      "vector": "[3-0-0:3]",
      "previous code": "MALE 5303",
      "description": "This course focuses on speech sounds in Standard Chinese. Its aim is to explain how different Chinese speech sounds are from the world's languages in general; and in what ways they are typical. This course provides a basis for understanding Chinese phonetics and phonology from theoretical and practical perspectives. It teaches students about how speech sounds are made by the human vocal tract and how they are organized for linguistic purposes. It will also equip students with essential knowledge in teaching Chinese sounds to second language (L2) learners. For MA(ILE) students or students with program director or course instructor's approval only.",
      "intended learning outcomes": "<span>On successful completion of the course, students will be able to:</span><table style=\"border:0px;\"><tr><td>1.</td><td>Understand the fundamental concepts in phonetics and phonology.</td></tr><tr><td>2.</td><td>Explain speech sounds (consonants, vowels and tones) of the Chinese language to L2 learners.</td></tr></table>"
    },
    "attrs": [
      {
        "title": "[READ]",
        "description": "Reading Material"
      }
    ],
    "sections": [
      {
        "Section": "L1 (1702)",
        "Date & Time": "WeFr 01:30PM - 02:50PM",
        "Room": "Rm 2610, Lift 31-32 (26)",
        "Instructor": [
          "YUAN, Su"
        ],
        "TA/IA/GTA": [],
        "Quota": 25,
        "Enrol": 25,
        "Avail": 0,
        "Wait": 2,
        "Remarks": [
          "For MA(ILE) students or students with program director or course instructor's approval only"
        ]
      }
    ]
  },
  {
    "program": "MILE",
    "code": "5304",
    "name": "Chinese Lexicology",
    "units": 3,
    "info": {
      "attributes": "[C] Require Chinese reading",
      "vector": "[3-0-0:3]",
      "previous code": "MALE 5304",
      "description": "This course provides a theoretical and practical introduction to Chinese lexicology, covering general and peculiar aspects of Chinese words and vocabulary, including word formation, semantic and grammatical structure of words, lexicalization, development and evolution of lexical items over time, the relationship between sound and meaning, and the cultural dimension of words. This course will also train students in using language corpora and other online resources to investigate Chinese vocabulary and deal with issues related to second language vocabulary teaching and learning. For MA(ILE) students or students with program director or course instructor's approval only.",
      "intended learning outcomes": "<span>On successful completion of the course, students will be able to:</span><table style=\"border:0px;\"><tr><td>1.</td><td>Appreciate and analyze basic concepts in Chinese lexicology including zi (字) and word (詞) in different contexts; compound and complex words; idiomatic expressions; lexical meaning and grammatical meaning; synonymy; antonymy; hypernymy; hyponymy; word structure and word formation.</td></tr><tr><td>2.</td><td>Explain Chinese word development over time and across different speech communities.</td></tr><tr><td>3.</td><td>Recognize approaches and methodologies in lexicology, including aspects of lexical semantics.</td></tr><tr><td>4.</td><td>Use corpora to investigate and develop lexical knowledge, and apply corpus-based method in vocabulary learning and\r\nteaching.</td></tr><tr><td>5.</td><td>Enhance abilities to deal with pedagogical issues in Chinese vocabulary teaching and learning.</td></tr></table>"
    },
    "attrs": [
      {
        "title": "[READ]",
        "description": "Reading Material"
      }
    ],
    "sections": [
      {
        "Section": "L1 (1703)",
        "Date & Time": "Fr 09:00AM - 11:50AM",
        "Room": "Rm 5506, Lift 25-26 (30)",
        "Instructor": [
          "ZHONG, Yin"
        ],
        "TA/IA/GTA": [],
        "Quota": 29,
        "Enrol": 29,
        "Avail": 0,
        "Wait": 1,
        "Remarks": [
          "For MA(ILE) students or students with program director or course instructor's approval only"
        ]
      }
    ]
  },
  {
    "program": "MILE",
    "code": "5308",
    "name": "The Practice of Teaching International Chinese",
    "units": 3,
    "info": {
      "attributes": "[C] Require Chinese reading",
      "vector": "[3-0-0:3]",
      "description": "The objective of this course is to enable students to apply their knowledge of language curriculum design, teaching methodology, and language learning to the practice of teaching Chinese. The course will provide students with a theoretical and practical foundational basis for teaching Chinese vocabulary, grammar, listening, speaking, reading, and writing. It will cover a range of topics, including teaching approaches, teaching plan design, training in teaching integrated skills, and classroom management techniques. By the end of the course, students will have developed their skills in teaching Chinese to foreign students and gained a deeper understanding of how to effectively design and deliver Chinese language lessons. The course will be appropriate for those teaching or planning to teach across sectors in Chinese language education, from Primary to Tertiary. For MA(ILE) students or students with program director or course instructor's approval only.",
      "intended learning outcomes": "<span>On successful completion of the course, students will be able to:</span><table style=\"border:0px;\"><tr><td>1.</td><td>Critically analyze and evaluate published teaching materials.</td></tr><tr><td>2.</td><td>Master the principles of teaching Chinese vocabulary, grammar, listening, speaking, reading, and writing.</td></tr><tr><td>3.</td><td>Design appropriate teaching plans by applying the professional knowledge acquired in this course.</td></tr><tr><td>4.</td><td>Design appropriate exercises in the training of listening, speaking, reading and writing skills.</td></tr><tr><td>5.</td><td>Demonstrate effective teaching in Chinese vocabulary, grammar, listening, speaking, reading, and writing.</td></tr></table>"
    },
    "attrs": [
      {
        "title": "[READ]",
        "description": "Reading Material"
      }
    ],
    "sections": [
      {
        "Section": "L1 (1704)",
        "Date & Time": "WeFr 04:30PM - 05:50PM",
        "Room": "Rm 2126C, Lift 19 (28)",
        "Instructor": [
          "LIANG, Sheila, Xin"
        ],
        "TA/IA/GTA": [],
        "Quota": 25,
        "Enrol": 25,
        "Avail": 0,
        "Wait": 0,
        "Remarks": [
          "For MA(ILE) students or students with program director or course instructor's approval only"
        ]
      }
    ]
  },
  {
    "program": "MILE",
    "code": "6000",
    "name": "Supervised Teaching Practicum",
    "units": 3,
    "info": {
      "vector": "[3 credits]",
      "previous code": "MALE 6000",
      "description": "This course provides students with practical training in the teaching of English and/or Chinese as a foreign language through classroom observation and supervised teaching practice. For MA(ILE) students or students with program director or course instructor's approval only.",
      "intended learning outcomes": "<span>On successful completion of the course, students will be able to:</span><table style=\"border:0px;\"><tr><td>1.</td><td>Design effective language lessons and produce lesson plans.</td></tr><tr><td>2.</td><td>Conduct observations of language teaching in a systematic and informed manner.</td></tr><tr><td>3.</td><td>Demonstrate a range of practical teaching techniques.</td></tr><tr><td>4.</td><td>Evaluate their own teaching effectiveness.</td></tr><tr><td>5.</td><td>Develop and adapt teaching materials to suit the needs of particular learners.</td></tr></table>"
    },
    "attrs": [],
    "sections": [
      {
        "Section": "T1 (1705)",
        "Date & Time": "WeFr 03:00PM - 04:20PM",
        "Room": "Rm 3301, Lift 17-18",
        "Instructor": [
          "LI, Po Lung",
          "LIANG, Sheila, Xin"
        ],
        "TA/IA/GTA": [],
        "Quota": 14,
        "Enrol": 14,
        "Avail": 0,
        "Wait": 2,
        "Remarks": [
          "For MA(ILE) students or students with program director or course instructor's approval only",
          "Instructor Consent Required"
        ]
      },
      {
        "Section": "T2 (1706)",
        "Date & Time": "WeFr 03:00PM - 04:20PM",
        "Room": "Rm 3401, Lift 17-18 (30)",
        "Instructor": [
          "LI, Po Lung",
          "LIANG, Sheila, Xin"
        ],
        "TA/IA/GTA": [],
        "Quota": 10,
        "Enrol": 10,
        "Avail": 0,
        "Wait": 0,
        "Remarks": [
          "For MA(ILE) students or students with program director or course instructor's approval only",
          "Instructor Consent Required"
        ]
      }
    ]
  },
  {
    "program": "MILE",
    "code": "6980",
    "name": "Research Project in International Language Education",
    "units": 3,
    "info": {
      "vector": "[3 credits]",
      "previous code": "MALE 6980",
      "description": "This course provides practical experience of carrying out an independent research project on chosen topic conducted under the supervision of a teaching faculty member of the MA program in International Language Education. Students work in pairs or small groups to produce a substantial research paper at the end of the project. Taught sessions on the course are a combination of pair/ small-group tutorials and whole-group discussion seminars / presentation of work in progress. For MA(ILE) students or students with program director or course instructor's approval only.",
      "intended learning outcomes": "<span>On successful completion of the course, students will be able to:</span><table style=\"border:0px;\"><tr><td>1.</td><td>Build on the research skills they have developed, either in a future teaching career as a researchactive practitioner or for MPhil or Doctoral (PhD / Ed.D) study.</td></tr></table>"
    },
    "attrs": [],
    "sections": [
      {
        "Section": "R1 (1707)",
        "Date & Time": "Tu 01:30PM - 04:20PM",
        "Room": "Rm 5566, Lift 27-28 (24)",
        "Instructor": [
          "CHEUNG, Anisa",
          "SIMPSON, James Edward Barbour"
        ],
        "TA/IA/GTA": [],
        "Quota": 15,
        "Enrol": 7,
        "Avail": 8,
        "Wait": 0,
        "Remarks": [
          "For MA(ILE) students or students with program director or course instructor's approval only",
          "Instructor Consent Required"
        ]
      }
    ]
  }
]