[
  {
    "program": "WBBA",
    "code": "2080",
    "name": "Doing Business in Asia",
    "units": 3,
    "info": {
      "exclusion": "WBBA 2010, WBBA 2020",
      "description": "This course explores the way key business and managerial practices play out in an Asian context. To be a successful business leader, students must possess not only the technical skills and knowledge, but also be able to deal with regional and international business issues independently. Therefore, this course provides a big-picture overview of the business framework in Asia, a platform for students to interact with leading business leaders to learn from their professional experience and obtain first-hand information of the market, as well as practical training on evaluating challenges and opportunities in doing business in Asia through a cross-disciplinary approach. This course intends to cover topical issues in marketing, management, accounting, information systems, economics, finance, etc. Through experiential exercises, case studies and class presentations, students are expected to apply their business knowledge to tackle global and regional business problems with a critical eye."
    },
    "attrs": [],
    "sections": [
      {
        "Section": "L1 (1587)",
        "Date & Time": "TuTh 03:00PM - 04:20PM",
        "Room": "Rm 1005, LSK Bldg (70)",
        "Instructor": [
          "CHEUNG, Cassian",
          "LAFON-VINAIS, Veronique J A"
        ],
        "TA/IA/GTA": [],
        "Quota": 56,
        "Enrol": 52,
        "Avail": 4,
        "Wait": 0,
        "Remarks": []
      }
    ]
  },
  {
    "program": "WBBA",
    "code": "4010",
    "name": "Capstone Project",
    "units": 4,
    "info": {
      "pre-requisite": "WBBA 2010 AND WBBA 2020",
      "description": "For WBB students only. This course is designed to provide final year WBB students with an opportunity to pursue business studies above and beyond the normal course offerings of HKUST Business School. Students will work on a challenging individual or team capstone project which allows them to 1) conduct empirical research, and 2) synthesize skills and knowledge learned from the program."
    },
    "attrs": [],
    "sections": [
      {
        "Section": "R1 (3934)",
        "Date & Time": "TBA",
        "Room": "TBA",
        "Instructor": [
          "NASON, Stephen William"
        ],
        "TA/IA/GTA": [],
        "Quota": 5,
        "Enrol": 0,
        "Avail": 5,
        "Wait": 0,
        "Remarks": []
      }
    ]
  }
]